<!-- placeholder-1 -->
```fish
terraform plan
```
<!-- placeholder-2 -->

<details><summary>Diff of 67 changes.</summary>

```diff
~ data.aws_iam_policy_document.github_actions_oidc_assume_role will be read during apply
# (config refers to values not yet known)
~ data.aws_iam_policy_document.ssm_db_password will be read during apply
# (depends on a resource or a module with changes pending)
~ data.cloudinit_config.api will be read during apply
# (config refers to values not yet known)
~ data.cloudinit_config.web will be read during apply
# (config refers to values not yet known)
+ aws_autoscaling_group.api will be created
+ aws_autoscaling_group.web will be created
+ aws_dynamodb_table.terraform_lock will be created
+ aws_eip.ngw will be created
+ aws_iam_instance_profile.ready_tagger_and_ssm_db_password will be created
+ aws_iam_instance_profile.ready_tagger_only will be created
+ aws_iam_openid_connect_provider.github_actions will be created
+ aws_iam_policy.ec2_create_tag will be created
+ aws_iam_policy.ssm_db_password will be created
+ aws_iam_role.github_actions_terraform_automation will be created
+ aws_iam_role.ready_tagger_and_ssm_db_password will be created
+ aws_iam_role.ready_tagger_only will be created
+ aws_iam_role_policy_attachment.dynamodb_full_access will be created
+ aws_iam_role_policy_attachment.ec2_create_tag will be created
+ aws_iam_role_policy_attachment.ec2_full_access will be created
+ aws_iam_role_policy_attachment.iam_full_access will be created
+ aws_iam_role_policy_attachment.ready_tagger_only will be created
+ aws_iam_role_policy_attachment.route53_full_access will be created
+ aws_iam_role_policy_attachment.s3_full_access will be created
+ aws_iam_role_policy_attachment.ssm_db_password will be created
+ aws_iam_role_policy_attachment.ssm_full_access will be created
+ aws_instance.db will be created
+ aws_internet_gateway.igw will be created
+ aws_launch_template.api will be created
+ aws_launch_template.web will be created
+ aws_lb.api will be created
+ aws_lb.web will be created
+ aws_lb_listener.api will be created
+ aws_lb_listener.web will be created
+ aws_lb_target_group.api will be created
+ aws_lb_target_group.web will be created
+ aws_nat_gateway.ngw will be created
+ aws_route.private will be created
+ aws_route.public will be created
+ aws_route53_record.web will be created
+ aws_route_table.private will be created
+ aws_route_table.public will be created
+ aws_route_table_association.private["primary"] will be created
+ aws_route_table_association.private["secondary"] will be created
+ aws_route_table_association.private["tetriary"] will be created
+ aws_route_table_association.public["primary"] will be created
+ aws_route_table_association.public["secondary"] will be created
+ aws_route_table_association.public["tetriary"] will be created
+ aws_s3_bucket.terraform_state will be created
+ aws_s3_bucket_server_side_encryption_configuration.terraform_state_crypto_conf will be created
+ aws_s3_bucket_versioning.terraform_bucket_versioning will be created
+ aws_security_group.api will be created
+ aws_security_group.api_lb will be created
+ aws_security_group.db will be created
+ aws_security_group.web will be created
+ aws_security_group.web_lb will be created
+ aws_ssm_parameter.db_password will be created
+ aws_ssm_service_setting.default_host_management will be created
+ aws_subnet.private["primary"] will be created
+ aws_subnet.private["secondary"] will be created
+ aws_subnet.private["tetriary"] will be created
+ aws_subnet.public["primary"] will be created
+ aws_subnet.public["secondary"] will be created
+ aws_subnet.public["tetriary"] will be created
+ aws_vpc.main will be created
+ terraform_data.wait_for_db will be created
+ module.ssm_default_host_management_role.aws_iam_role.this[0] will be created
+ module.ssm_default_host_management_role.aws_iam_role_policy_attachment.custom[0] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 63 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @rkohanyi at 2024-11-27T13:22:34Z [(view log)](https://github.com/rkohanyi/example-infra/actions/runs/12051200019/job/33602353058#step:5:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_actions_oidc_assume_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_actions_oidc_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:rkohanyi/example-infra:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.ssm_db_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ssm_db_password" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-central-1:047719633548:parameter/db_password",
            ]
        }
    }

  # data.cloudinit_config.api will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "api" {
      + base64_encode = false
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #!/bin/bash
                dnf update -y
                dnf install -y docker
                systemctl enable --now docker
                usermod -aG docker ec2-user
                newgrp docker
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "00-install-docker.sh"
        }
      + part {
          + content      = (known after apply)
          + content_type = "text/x-shellscript"
          + filename     = "01-deploy-api.sh"
        }
    }

  # data.cloudinit_config.web will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "web" {
      + base64_encode = false
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #!/bin/bash
                dnf update -y
                dnf install -y docker
                systemctl enable --now docker
                usermod -aG docker ec2-user
                newgrp docker
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "00-install-docker.sh"
        }
      + part {
          + content      = (known after apply)
          + content_type = "text/x-shellscript"
          + filename     = "01-deploy-web.sh"
        }
    }

  # aws_autoscaling_group.api will be created
  + resource "aws_autoscaling_group" "api" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = (known after apply)
      + name_prefix                      = "api-asg-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 0
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = false
          + value               = "api-asg"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = false
          + value               = "main"
        }

      + traffic_source (known after apply)
    }

  # aws_autoscaling_group.web will be created
  + resource "aws_autoscaling_group" "web" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = (known after apply)
      + name_prefix                      = "web-asg-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 0
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = false
          + value               = "web-asg"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = false
          + value               = "main"
        }

      + traffic_source (known after apply)
    }

  # aws_dynamodb_table.terraform_lock will be created
  + resource "aws_dynamodb_table" "terraform_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Project" = "main"
        }
      + tags_all         = {
          + "Project" = "main"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_eip.ngw will be created
  + resource "aws_eip" "ngw" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_iam_instance_profile.ready_tagger_and_ssm_db_password will be created
  + resource "aws_iam_instance_profile" "ready_tagger_and_ssm_db_password" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ReadyTaggerAndSSMDbPasswordInstanceProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ReadyTaggerAndSSMDbPasswordRole"
      + tags        = {
          + "Project" = "main"
        }
      + tags_all    = {
          + "Project" = "main"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.ready_tagger_only will be created
  + resource "aws_iam_instance_profile" "ready_tagger_only" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ReadyTaggerOnlyInstanceProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ReadyTaggerOnlyRole"
      + tags        = {
          + "Project" = "main"
        }
      + tags_all    = {
          + "Project" = "main"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Project" = "main"
        }
      + tags_all        = {
          + "Project" = "main"
        }
      + thumbprint_list = [
          + "ffffffffffffffffffffffffffffffffffffffff",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_policy.ec2_create_tag will be created
  + resource "aws_iam_policy" "ec2_create_tag" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AllowEC2CreateTags"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Project" = "main"
        }
      + tags_all         = {
          + "Project" = "main"
        }
    }

  # aws_iam_policy.ssm_db_password will be created
  + resource "aws_iam_policy" "ssm_db_password" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AllowSSMDbPassword"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Project" = "main"
        }
      + tags_all         = {
          + "Project" = "main"
        }
    }

  # aws_iam_role.github_actions_terraform_automation will be created
  + resource "aws_iam_role" "github_actions_terraform_automation" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActionsTerraformAutomationRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ready_tagger_and_ssm_db_password will be created
  + resource "aws_iam_role" "ready_tagger_and_ssm_db_password" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ReadyTaggerAndSSMDbPasswordRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Project" = "main"
        }
      + tags_all              = {
          + "Project" = "main"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ready_tagger_only will be created
  + resource "aws_iam_role" "ready_tagger_only" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ReadyTaggerOnlyRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Project" = "main"
        }
      + tags_all              = {
          + "Project" = "main"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.dynamodb_full_access will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess"
      + role       = "GitHubActionsTerraformAutomationRole"
    }

  # aws_iam_role_policy_attachment.ec2_create_tag will be created
  + resource "aws_iam_role_policy_attachment" "ec2_create_tag" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ReadyTaggerAndSSMDbPasswordRole"
    }

  # aws_iam_role_policy_attachment.ec2_full_access will be created
  + resource "aws_iam_role_policy_attachment" "ec2_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
      + role       = "GitHubActionsTerraformAutomationRole"
    }

  # aws_iam_role_policy_attachment.iam_full_access will be created
  + resource "aws_iam_role_policy_attachment" "iam_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/IAMFullAccess"
      + role       = "GitHubActionsTerraformAutomationRole"
    }

  # aws_iam_role_policy_attachment.ready_tagger_only will be created
  + resource "aws_iam_role_policy_attachment" "ready_tagger_only" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ReadyTaggerOnlyRole"
    }

  # aws_iam_role_policy_attachment.route53_full_access will be created
  + resource "aws_iam_role_policy_attachment" "route53_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonRoute53FullAccess"
      + role       = "GitHubActionsTerraformAutomationRole"
    }

  # aws_iam_role_policy_attachment.s3_full_access will be created
  + resource "aws_iam_role_policy_attachment" "s3_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "GitHubActionsTerraformAutomationRole"
    }

  # aws_iam_role_policy_attachment.ssm_db_password will be created
  + resource "aws_iam_role_policy_attachment" "ssm_db_password" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ReadyTaggerAndSSMDbPasswordRole"
    }

  # aws_iam_role_policy_attachment.ssm_full_access will be created
  + resource "aws_iam_role_policy_attachment" "ssm_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMFullAccess"
      + role       = "GitHubActionsTerraformAutomationRole"
    }

  # aws_instance.db will be created
  + resource "aws_instance" "db" {
      + ami                                  = "ami-0b5673b5f6e8f7fa7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ReadyTaggerAndSSMDbPasswordInstanceProfile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "main-db"
          + "Project" = "main"
        }
      + tags_all                             = {
          + "Name"    = "main-db"
          + "Project" = "main"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b774a67e57510bc71ec5199825501b7c1374e000"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "main-igw"
          + "Project" = "main"
        }
      + tags_all = {
          + "Name"    = "main-igw"
          + "Project" = "main"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.api will be created
  + resource "aws_launch_template" "api" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0b5673b5f6e8f7fa7"
      + instance_type   = "t3.micro"
      + latest_version  = (known after apply)
      + name            = "api-template"
      + name_prefix     = (known after apply)
      + tags            = {
          + "Name"    = "main-api-template"
          + "Project" = "main"
        }
      + tags_all        = {
          + "Name"    = "main-api-template"
          + "Project" = "main"
        }
      + user_data       = (known after apply)

      + iam_instance_profile {
          + name = "ReadyTaggerAndSSMDbPasswordInstanceProfile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "main-api"
              + "Project" = "main"
            }
        }
    }

  # aws_launch_template.web will be created
  + resource "aws_launch_template" "web" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0b5673b5f6e8f7fa7"
      + instance_type   = "t3.micro"
      + latest_version  = (known after apply)
      + name            = "web-template"
      + name_prefix     = (known after apply)
      + tags            = {
          + "Name"    = "main-web-template"
          + "Project" = "main"
        }
      + tags_all        = {
          + "Name"    = "main-web-template"
          + "Project" = "main"
        }
      + user_data       = (known after apply)

      + iam_instance_profile {
          + name = "ReadyTaggerOnlyInstanceProfile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "main-web"
              + "Project" = "main"
            }
        }
    }

  # aws_lb.api will be created
  + resource "aws_lb" "api" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "api-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Project" = "main"
        }
      + tags_all                                                     = {
          + "Project" = "main"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb.web will be created
  + resource "aws_lb" "web" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "web-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Project" = "main"
        }
      + tags_all                                                     = {
          + "Project" = "main"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.api will be created
  + resource "aws_lb_listener" "api" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags_all                 = (known after apply)
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener.web will be created
  + resource "aws_lb_listener" "web" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags_all                 = (known after apply)
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.api will be created
  + resource "aws_lb_target_group" "api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "api-lb-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Project" = "main"
        }
      + tags_all                           = {
          + "Project" = "main"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = (known after apply)
          + path                = "/api/cars"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_lb_target_group.web will be created
  + resource "aws_lb_target_group" "web" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "web-lb-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Project" = "main"
        }
      + tags_all                           = {
          + "Project" = "main"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_nat_gateway.ngw will be created
  + resource "aws_nat_gateway" "ngw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"    = "main-ngw"
          + "Project" = "main"
        }
      + tags_all                           = {
          + "Name"    = "main-ngw"
          + "Project" = "main"
        }
    }

  # aws_route.private will be created
  + resource "aws_route" "private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route53_record.web will be created
  + resource "aws_route53_record" "web" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "web.terraform.codecool.click"
      + type            = "A"
      + zone_id         = "Z0822427CQ05YNYZ55GW"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"    = "main-private"
          + "Project" = "main"
        }
      + tags_all         = {
          + "Name"    = "main-private"
          + "Project" = "main"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"    = "main-public"
          + "Project" = "main"
        }
      + tags_all         = {
          + "Name"    = "main-public"
          + "Project" = "main"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private["primary"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private["secondary"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private["tetriary"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public["primary"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public["secondary"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public["tetriary"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after
…
```
</details>
<!-- placeholder-5 -->
<!-- terraform-1-a9422b584118f6d71f77b7807de4e5ad.tfplan -->
<!-- placeholder-6 -->